# BOT_TOKEN = "6857740783:AAF2JsAWEkLra0u9PdWHBUFySonglckn_Vk"
BOT_TOKEN = "6469830886:AAF9QhbENGAs7w9mH0x_BJ-a-o2lPTTgDOA"
# ID админской группы в которую будут приходить сообщения о юзеров
# ADMIN_CHAT_ID = -1001991471871
ADMIN_CHAT_ID = -1001966122887
LOG_FILE = 'logs/bot.log'

# Время задержки для спама (Сколько должно пройти времени между сообщениями для того, чтобы не считаться спамом)
THROTTLE_TIME = 1

# Путь до базы данных
DB_PATH = "data\\users.db"
# Путь до файла с расписанием в формате json
SCHEDULE_PATH = "data\\combined_schedule.json"
# Путь до папки с исходниками расписаний
ORIGINAL_SCHEDULES_PATH = "C:\\Users\\normal\\Desktop\\tks\\preparation\\"


# Список групп
groups = []

# Список преподавателей
teachers = ["Арепьева Е.Е.", "Безбожнов О.Н.", "Василюк Д.И.", "Галич С.В.",
            "Гладков И.Ф.", "Гомазкова Л.К.", "Дмитриенко Н.Р.", "Елфимова О.И.",
            "Ермакова Н.Н.", "Задорожнева Ю.В.", "Карташевский В.Г.", "Керенцева Н.Д.",
            "Пономарев И.Н.", "Ромасевич Е.П.", "Ромасевич П.В.", "Сафонова О.Е.",
            "Семенов Е.С.", "Семенова О.В.", "Серёженко И.Д.", "Стебенькова Н.А.",
            "Трофимов А.И.", "Тюхтяев Д.А.", "Стебеньков А.М.", "Чадаев Д.И.",
            "Черных С.В."]

# Список аудиторий
rooms = ["1-19М", "2-01K", "2-06М", "2-13М", "2-17М", "3-15К", "3-16К", "2-13аМ,3-15бК"]

schedule = None
