BOT_TOKEN = "6857740783:AAF2JsAWEkLra0u9PdWHBUFySonglckn_Vk"
# ID админской группы в которую будут приходить сообщения о юзеров
ADMIN_CHAT_ID = -1001991471871
LOG_FILE = 'logs/bot.log'

# Время задержки для спама (Сколько должно пройти времени между сообщениями для того, чтобы не считаться спамом)
THROTTLE_TIME = 1.5

# Путь до базы данных
DB_PATH = "data\\users.db"
# Путь до файла с расписанием в формате json
SCHEDULE_PATH = "data\\schedule.db"
# Путь до папки с исходниками расписаний
ORIGINAL_SCHEDULES_PATH = "C:\\Users\\normal\\Desktop\\tks\\preparation\\"


# Список групп (не подгружается автоматом при запуске скрипта или изменения расписания)
groups = ['ИБТС-211', 'ИБТС-221', 'ИБТС-231', 'ИБТС-231_2',
          'ИТСб-201', 'ИТСб-211', 'ИТСб-211_2', 'ИТСб-221',
          'ИТСб-221_2', 'ИТСб-231', 'ИТСб-231_2', 'РСК-201',
          'РСК-211', 'РСК-221', 'РСК-231', 'ИТСм-231',
          'ИТСм-221']

# Список преподавателей
teachers = ["Арепьева Е.Е.", "Безбожнов О.Н.", "Василюк Д.И.", "Галич С.В.",
            "Гладков И.Ф.", "Гомазкова Л.К.", "Дмитриенко Н.Р.", "Елфимова О.И.",
            "Ермакова Н.Н.", "Задорожнева Ю.В.", "Карташевский В.Г.", "Керенцева Н.Д.",
            "Пономарев И.Н.", "Ромасевич Е.П.", "Ромасевич П.В.", "Сафонова О.Е.",
            "Семенов Е.С.", "Семенова О.В.", "Серёженко И.Д.", "Стебенькова Н.А.",
            "Трофимов А.И.", "Тюхтяев Д.А.", "Стебеньков А.М.", "Чадаев Д.И.",
            "Черных С.В.", "Яцышен В.В."]

# Список аудиторий
rooms = ["1-19М", "2-01K", "2-06М", "2-13М", "2-17М", "3-15К", "3-16К", "2-13аМ,3-15бК"]

schedule = None
