import os

# Указывается в Dockerfile
BOT_TOKEN = os.getenv("BOT_TOKEN")
ADMIN_CHAT_ID = int(os.getenv("ADMIN_CHAT_ID"))
USERS_DB = os.getenv("USERS_DB")
ACTIVITIES_DB = os.getenv("ACTIVITIES_DB")
SCHEDULE_DB = os.getenv("SCHEDULE_DB")
LOG_FILE = os.getenv("LOG_FILE")
timezone = os.getenv("TIMEZONE")

# Время задержки для спама (Сколько должно пройти времени между сообщениями для того, чтобы не считаться спамом)
THROTTLE_TIME = 1.5


# Список групп (не подгружается автоматом при запуске скрипта или изменения расписания)
groups = ['ИБТС-211', 'ИБТС-221', 'ИБТС-231',
          'ИБТС-231_2', 'ИТСб-201', 'ИТСб-211',
          'ИТСб-211_2', 'ИТСб-221', 'ИТСб-221_2',
          'ИТСб-231', 'ИТСб-231_2', 'РСК-201',
          'РСК-211', 'РСК-221', 'РСК-231',
          'ИТСм-231', 'ИТСм-221']

# Список преподавателей
teachers = ["Арепьева Е.Е.", "Безбожнов О.Н.", "Василюк Д.И.", "Галич С.В.",
            "Гладков И.Ф.", "Гомазкова Л.К.", "Дмитриенко Н.Р.", "Елфимова О.И.",
            "Ермакова Н.Н.", "Задорожнева Ю.В.", "Карташевский В.Г.", "Керенцева Н.Д.",
            "Пономарев И.Н.", "Ромасевич Е.П.", "Ромасевич П.В.", "Сафонова О.Е.",
            "Семенов Е.С.", "Семенова О.В.", "Серёженко И.Д.", "Стебенькова Н.А.",
            "Трофимов А.И.", "Тюхтяев Д.А.", "Стебеньков А.М.", "Чадаев Д.И.",
            "Черных С.В.", "Яцышен В.В."]

all_teachers = ["Арепьева Е.Е.", "Безбожнов О.Н.", "Василюк Д.И.", "Галич С.В.",
                "Гладков И.Ф.", "Гомазкова Л.К.", "Дмитриенко Н.Р.", "Елфимова О.И.",
                "Ермакова Н.Н.", "Задорожнева Ю.В.", "Карташевский В.Г.", "Керенцева Н.Д.",
                "Окунев В.Г.", "Пономарев И.Н.", "Ромасевич Е.П.", "Ромасевич П.В.",
                "Сафонова О.Е.", "Семенов Е.С.", "Семенова О.В.", "Серёженко И.Д.",
                "Стебенькова Н.А.", "Трофимов А.И.", "Тюхтяев Д.А.", "Стебеньков А.М.",
                "Чадаев Д.И.", "Черных С.В.", "Яцышен В.В."]

college_teachers = ["Безбожнов О.Н.", "Гладков И.Ф.", "Дмитриенко Н.Р.",
                    "Ермакова Н.Н.", "Задорожнева Ю.В.", "Керенцева Н.Д.",
                    "Семенова О.В.", "Серёженко И.Д.", "Трофимов А.И."]

# Список студентов - преподавателей колледжа
special_teachers = {'Гладков И.Ф.': 'ИТСм-231',
                    'Окунев В.Г.': 'РСК-211',
                    'Керенцева Н.Д.': 'ИТСб-201',
                    'Серёженко И.Д.': 'ИТСм-231',
                    'Трофимов А.И.': 'РСК-201'}

# Список аудиторий
rooms = ["2-01К", "3-15К", "3-16К",
         "2-06М", "2-13М", "2-17М",
         "1-19М"]
